dqb.org
#+TITLE: DynamicQueryBuilder
#+Author: Cem YILMAZ <cmylmzbm@outlook.com>
#+SETUPFILE: ~/org/setup.config

* What?

DynamicQueryBuilder(DQB) is a lightweight LINQ builder library that works dynamically with the given
collection generic type.

* Why?
The motivation behind DQB was to reverse the
development cost of operations such as Filtering, Sorting, Paginating data from
backend to clients. This allows client development to be more free and less
time consuming for non-fullstack development workspaces.

* Installation
You can get DQB from NuGet services with the command below or NuGet UI in visual
studio.

DQB currently runs with .netstandard2.1
#+BEGIN_SRC
Install-Package DynamicQueryBuilder
#+END_SRC

* DynamicQueryOptions

This is the class that holds everything from filters to sorts and pagination 
options. DQB's has a function called *~ApplyFilters~* which converts
this *~DynamicQueryOptions~* class into a LINQ expression. You can check out
this object [[https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/DynamicQueryOptions.cs][here]].

** Basic usage of DQB like below:
#+BEGIN_SRC csharp
IQueryable<MyObject> myCollection = GetMyCollectionOfData();
var myOpts = new DynamicQueryOptions
{
    /*
      Filters,
      SortingOptions,
      Pagination
    ,*/
};

IQueryable<MyObject> dqbResults = myCollection.ApplyFilters(myOpts);
return dqbResults.ToList();
#+END_SRC

* Filters

Filters are the objects that hold your logical filters. Currently, DQB only
support ~AndAlso~ statements. You can see the object structure [[https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/Filter.cs][here]].

*** Filter Value Conversion
Since DQB always boxes your data into an ~object~ the actual type conversion is
being handled by DQB while transforming your filters into a LINQ expression. DQB
also can handle ~null~ values as well.

** Supported Filters
#+BEGIN_SRC csharp
In,
Equals,
LessThan,
Contains,
NotEqual,
EndsWith,
StartsWith,
GreaterThan,
LessThanOrEqual,
GreaterThanOrEqual,
Any,
All
#+END_SRC

*** Filter Examples
An example usage of ~Filter~ class with a flat object:

#+BEGIN_SRC csharp
var dqbOpts = new DynamicQueryOptions
{
    Filters = new List<Filter>()
    {
        new Filter
        {
            Value = "bar",
            PropertyName = "foo",
            Operator = FilterOperation.Equals
        }
    }
};

// LINQ Translation: myCollection.Where(x => x.foo == "bar");
#+END_SRC

An example usage of ~Filter~ class with a collection property:

#+BEGIN_SRC csharp
var dqbOpts = new DynamicQueryOptions
{
    var filter = new Filter
    {
        Value = new DynamicQueryOptions
        {
            Value = "some_value",
            Operator = FilterOperation.Equals,
            PropertyName = "bar"
        },
        Operator = FilterOperation.Any,
        PropertyName = "foo"
    }
};

// LINQ Translation: myCollection.Where(x => x.foo.Any(y => y.bar == "some_value"));
#+END_SRC

* Sorting

Sorting is extremely easy with DQB. DQB currently does not support for custom
sorting callbacks and uses default .NET's ~OrderBy~, ~OrderByDescending~,
~ThenBy~ and ~ThenByDescending~ functions. Sorting should be provided via
~SortOption~ class which you can check out [[https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/SortOption.cs][here]].

