dqb.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-14 Cts 15:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DynamicQueryBuilder</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Cem YILMAZ &lt;cmylmzbm@outlook.com&gt;" />
<link href="https://stackpath.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">DynamicQueryBuilder</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org57a37e5">1. What?</a></li>
<li><a href="#orgf6bc477">2. Why?</a></li>
<li><a href="#org396da03">3. Installation</a></li>
<li><a href="#orgeccd156">4. DynamicQueryOptions</a>
<ul>
<li><a href="#orgeb14fae">4.1. Basic usage of DQB like below:</a></li>
</ul>
</li>
<li><a href="#org2bd2874">5. Filters</a>
<ul>
<li>
<ul>
<li><a href="#orgc8a71fa">5.0.1. Filter Value Conversion</a></li>
</ul>
</li>
<li><a href="#org4134868">5.1. Supported Filters</a>
<ul>
<li><a href="#orgf1f9fea">5.1.1. Filter Examples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org90943c2">6. Sorting</a>
<ul>
<li>
<ul>
<li><a href="#org6bb3f68">6.0.1. Sorting Examples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7ff4ad0">7. Accessing Nested Objects</a></li>
<li><a href="#org71ec9c7">8. Pagination</a>
<ul>
<li><a href="#orgac82e71">8.1. Pagination Examples:</a>
<ul>
<li><a href="#orgc72ff4f">8.1.1. How to access the filtered count of the query</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgeed0305">9. Web Development with DQB</a>
<ul>
<li><a href="#org9ff5f0f">9.1. Setting up DynamicQueryBuilderSettings</a></li>
<li><a href="#org7b1f58e">9.2. Query Delivery Methods</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org57a37e5" class="outline-2">
<h2 id="org57a37e5"><span class="section-number-2">1</span> What?</h2>
<div class="outline-text-2" id="text-1">
<p>
DynamicQueryBuilder(DQB) is a lightweight LINQ builder library that works dynamically with the given
collection generic type.
</p>
</div>
</div>

<div id="outline-container-orgf6bc477" class="outline-2">
<h2 id="orgf6bc477"><span class="section-number-2">2</span> Why?</h2>
<div class="outline-text-2" id="text-2">
<p>
The motivation behind DQB was to reverse the
development cost of operations such as Filtering, Sorting, Paginating data from
backend to clients. This allows client development to be more free and less
time consuming for non-fullstack development workspaces.
</p>
</div>
</div>

<div id="outline-container-org396da03" class="outline-2">
<h2 id="org396da03"><span class="section-number-2">3</span> Installation</h2>
<div class="outline-text-2" id="text-3">
<p>
You can get DQB from NuGet services with the command below or NuGet UI in visual
studio.
</p>

<p>
DQB currently runs with .netstandard2.1
</p>
<pre class="example">
Install-Package DynamicQueryBuilder
</pre>
</div>
</div>

<div id="outline-container-orgeccd156" class="outline-2">
<h2 id="orgeccd156"><span class="section-number-2">4</span> DynamicQueryOptions</h2>
<div class="outline-text-2" id="text-4">
<p>
This is the class that holds everything from filters to sorts and pagination 
options. DQB&rsquo;s has a function called <b><code>ApplyFilters</code></b> which converts
this <b><code>DynamicQueryOptions</code></b> class into a LINQ expression. You can check out
this object <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/DynamicQueryOptions.cs">here</a>.
</p>
</div>

<div id="outline-container-orgeb14fae" class="outline-3">
<h3 id="orgeb14fae"><span class="section-number-3">4.1</span> Basic usage of DQB like below:</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #35CDAF;">IQueryable</span><span style="color: #C586C0;">&lt;</span>MyObject<span style="color: #C586C0;">&gt;</span> <span style="color: #85DDFF;">myCollection</span> = GetMyCollectionOfData<span style="color: #C586C0;">()</span>;
<span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">myOpts</span> = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryOptions</span>
<span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">/*</span>
<span style="color: #579C4C;">      Filters,</span>
<span style="color: #579C4C;">      SortingOptions,</span>
<span style="color: #579C4C;">      Pagination</span>
<span style="color: #579C4C;">    */</span>
<span style="color: #C586C0;">}</span>;

<span style="color: #35CDAF;">IQueryable</span><span style="color: #C586C0;">&lt;</span>MyObject<span style="color: #C586C0;">&gt;</span> <span style="color: #85DDFF;">dqbResults</span> = myCollection.<span style="color: #D9DAA2;">ApplyFilters</span><span style="color: #C586C0;">(</span>myOpts<span style="color: #C586C0;">)</span>;
<span style="color: #339CDB;">return</span> dqbResults.<span style="color: #D9DAA2;">ToList</span><span style="color: #C586C0;">()</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2bd2874" class="outline-2">
<h2 id="org2bd2874"><span class="section-number-2">5</span> Filters</h2>
<div class="outline-text-2" id="text-5">
<p>
Filters are the objects that hold your logical filters. Currently, DQB only
support <code>AndAlso</code> statements. You can see the object structure <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/Filter.cs">here</a>.
</p>
</div>

<div id="outline-container-orgc8a71fa" class="outline-4">
<h4 id="orgc8a71fa"><span class="section-number-4">5.0.1</span> Filter Value Conversion</h4>
<div class="outline-text-4" id="text-5-0-1">
<p>
Since DQB always boxes your data into an <code>object</code> the actual type conversion is
being handled by DQB while transforming your filters into a LINQ expression. DQB
also can handle <code>null</code> values as well.
</p>
</div>
</div>

<div id="outline-container-org4134868" class="outline-3">
<h3 id="org4134868"><span class="section-number-3">5.1</span> Supported Filters</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-csharp">In,
Equals,
LessThan,
Contains,
NotEqual,
EndsWith,
StartsWith,
GreaterThan,
LessThanOrEqual,
GreaterThanOrEqual,
Any,
All
</pre>
</div>
</div>

<div id="outline-container-orgf1f9fea" class="outline-4">
<h4 id="orgf1f9fea"><span class="section-number-4">5.1.1</span> Filter Examples</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
An example usage of <code>Filter</code> class with a flat object:
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">dqbOpts</span> = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryOptions</span>
<span style="color: #C586C0;">{</span>
    Filters = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">List</span><span style="color: #DB8E73;">&lt;</span>Filter<span style="color: #DB8E73;">&gt;()</span>
    <span style="color: #DB8E73;">{</span>
        <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Filter</span>
        <span style="color: #579C4C;">{</span>
            Value = <span style="color: #DB8E73;">"bar"</span>,
            PropertyName = <span style="color: #DB8E73;">"foo"</span>,
            Operator = FilterOperation.Equals
        <span style="color: #579C4C;">}</span>
    <span style="color: #DB8E73;">}</span>
<span style="color: #C586C0;">}</span>;

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">LINQ Translation: myCollection.</span><span style="color: #D9DAA2;">Where</span><span style="color: #579C4C;">(x =&gt; x.foo == "bar");</span>
</pre>
</div>

<p>
An example usage of <code>Filter</code> class with a collection property:
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">dqbOpts</span> = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryOptions</span>
<span style="color: #C586C0;">{</span>
    <span style="color: #339CDB;">var</span> filter = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Filter</span>
    <span style="color: #DB8E73;">{</span>
        Value = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryOptions</span>
        <span style="color: #579C4C;">{</span>
            Value = <span style="color: #DB8E73;">"some_value"</span>,
            Operator = FilterOperation.Equals,
            PropertyName = <span style="color: #DB8E73;">"bar"</span>
        <span style="color: #579C4C;">}</span>,
        Operator = FilterOperation.Any,
        PropertyName = <span style="color: #DB8E73;">"foo"</span>
    <span style="color: #DB8E73;">}</span>
<span style="color: #C586C0;">}</span>;

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">LINQ Translation: myCollection.</span><span style="color: #D9DAA2;">Where</span><span style="color: #579C4C;">(x =&gt; x.foo.</span><span style="color: #D9DAA2;">Any</span><span style="color: #579C4C;">(y =&gt; y.bar == "some_value"));</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org90943c2" class="outline-2">
<h2 id="org90943c2"><span class="section-number-2">6</span> Sorting</h2>
<div class="outline-text-2" id="text-6">
<p>
Sorting is extremely easy with DQB. DQB currently does not support for custom
sorting callbacks and uses default .NET&rsquo;s <code>OrderBy</code>, <code>OrderByDescending</code>,
<code>ThenBy</code> and <code>ThenByDescending</code> functions. Sorting should be provided via
<code>SortOption</code> class which you can check out <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/SortOption.cs">here</a>.
</p>
</div>
