dqb.html

<div id="outline-container-org6bb3f68" class="outline-4">
<h4 id="org6bb3f68"><span class="section-number-4">6.0.1</span> Sorting Examples</h4>
<div class="outline-text-4" id="text-6-0-1">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">dqbOpts</span> = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryOptions</span>
<span style="color: #C586C0;">{</span>
    SortOptions = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">List</span><span style="color: #DB8E73;">&lt;</span>SortOption<span style="color: #DB8E73;">&gt;()</span>
    <span style="color: #DB8E73;">{</span>
        <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">SortOption</span>
        <span style="color: #579C4C;">{</span>
            SortingDirection = SortingDirection.Asc,
            PropertyName = <span style="color: #DB8E73;">"Foo"</span>
        <span style="color: #579C4C;">}</span>;

        <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">SortOption</span>
        <span style="color: #579C4C;">{</span>
            SortingDirection = SortingDirection.Desc,
            PropertyName = <span style="color: #DB8E73;">"Bar"</span>
        <span style="color: #579C4C;">}</span>;
    <span style="color: #DB8E73;">}</span>
<span style="color: #C586C0;">}</span>;

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">LINQ Translation: myCollection.</span><span style="color: #D9DAA2;">OrderBy</span><span style="color: #579C4C;">(x =&gt; x.Foo).</span><span style="color: #D9DAA2;">ThenByDescending</span><span style="color: #579C4C;">(x =&gt; x.Bar);</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7ff4ad0" class="outline-2">
<h2 id="org7ff4ad0"><span class="section-number-2">7</span> Accessing Nested Objects</h2>
<div class="outline-text-2" id="text-7">
<p>
DQB can access nested object with <code>.</code> delimeter like C# LINQ.
</p>
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #339CDB;">public</span> <span style="color: #339CDB;">class</span> <span style="color: #35CDAF;">MyNestedClass</span>
<span style="color: #C586C0;">{</span>
    <span style="color: #339CDB;">public</span> <span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">Age</span> <span style="color: #DB8E73;">{</span> <span style="color: #339CDB;">get</span>; <span style="color: #339CDB;">set</span>; <span style="color: #DB8E73;">}</span>
<span style="color: #C586C0;">}</span>

<span style="color: #339CDB;">public</span> <span style="color: #339CDB;">class</span> <span style="color: #35CDAF;">MyClassToFilter</span>
<span style="color: #C586C0;">{</span>
    <span style="color: #339CDB;">public</span> <span style="color: #35CDAF;">MyNestedClass</span> <span style="color: #85DDFF;">MyNestedProperty</span> <span style="color: #DB8E73;">{</span> <span style="color: #339CDB;">get</span>; <span style="color: #339CDB;">set</span>; <span style="color: #DB8E73;">}</span>
<span style="color: #C586C0;">}</span>
</pre>
</div>

<p>
With the object structures above, we could utilize <code>Filter</code> and <code>Sort</code>
operations like below:
</p>

<ul class="org-ul">
<li><p>
<b>Filter</b>
</p>
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">Filter</span>
<span style="color: #C586C0;">{</span>
    Value = <span style="color: #DB8E73;">"27"</span>,
    Operator = FilterOperation.Equals,
    PropertyName = <span style="color: #DB8E73;">"MyNestedProperty.Age"</span>
<span style="color: #C586C0;">}</span>;

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">LINQ Translation: myCollection.</span><span style="color: #D9DAA2;">Where</span><span style="color: #579C4C;">(x =&gt; x.MyNestedProperty.Age == 28);</span>
</pre>
</div></li>

<li><p>
<b>Sort</b>
</p>
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">SortOption</span>
<span style="color: #C586C0;">{</span>
    SortingDirection = SortingDirection.Asc,
    PropertyName = <span style="color: #DB8E73;">"MyNestedProperty.Age"</span>
<span style="color: #C586C0;">}</span>

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">LINQ Translation: myCollection.</span><span style="color: #D9DAA2;">OrderBy</span><span style="color: #579C4C;">(x =&gt; x.MyNestedProperty.Age);</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org71ec9c7" class="outline-2">
<h2 id="org71ec9c7"><span class="section-number-2">8</span> Pagination</h2>
<div class="outline-text-2" id="text-8">
<p>
Pagination can be done by specifiynig options into the <code>PaginationOptions</code>
member of <code>DynamicQueryOptions</code> class. You can check it out <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/PaginationOption.cs">here</a>.
Pagination utilizes LINQ&rsquo;s <code>Skip</code> and <code>Take</code> functions.
</p>
</div>

<div id="outline-container-orgac82e71" class="outline-3">
<h3 id="orgac82e71"><span class="section-number-3">8.1</span> Pagination Examples:</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">paginationOption</span> = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">PaginationOption</span>
<span style="color: #C586C0;">{</span>
    Count = <span style="color: #B5CEA8; font-weight: bold;">10</span>,
    Offset = <span style="color: #B5CEA8; font-weight: bold;">0</span>,
    AssignDataSetCount = <span style="color: #339CDB;">true</span>
<span style="color: #C586C0;">}</span>;

<span style="color: #579C4C;">// </span><span style="color: #579C4C;">LINQ Translation: myCollection.</span><span style="color: #D9DAA2;">Skip</span><span style="color: #579C4C;">(0).</span><span style="color: #D9DAA2;">Take</span><span style="color: #579C4C;">(10);</span>
</pre>
</div>
</div>

<div id="outline-container-orgc72ff4f" class="outline-4">
<h4 id="orgc72ff4f"><span class="section-number-4">8.1.1</span> How to access the filtered count of the query</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
if its required to access the total query result amount(whole set) you can access it via
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #35CDAF;">int</span> <span style="color: #85DDFF;">totalDataSetCount</span> = paginationOption.DataSetCount;
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgeed0305" class="outline-2">
<h2 id="orgeed0305"><span class="section-number-2">9</span> Web Development with DQB</h2>
<div class="outline-text-2" id="text-9">
<p>
Web development is actually where DQB shines the most. DQB comes with an
<code>ActionFilter</code> that can parse HTTP queries into <code>DynamicQueryOptions</code> class.
</p>
</div>

<div id="outline-container-org9ff5f0f" class="outline-3">
<h3 id="org9ff5f0f"><span class="section-number-3">9.1</span> Setting up DynamicQueryBuilderSettings</h3>
<div class="outline-text-3" id="text-9-1">
<p>
This is a singleton object that can hold static configurations for DQB like
operation shortcodes, query resolution methods and data source case sensitivity.
You can check out this object <a href="https://github.com/oplog/DynamicQueryBuilder/blob/master/DynamicQueryBuilder/Models/DynamicQueryBuilderSettings.cs">here</a>.
</p>

<p>
It is usually best to create an instance of this class in your Web Projects
<code>Startup.cs</code> and inject it as a singleton like below
</p>

<div class="org-src-container">
<pre class="src src-csharp">    <span style="color: #339CDB;">public</span> <span style="color: #339CDB;">class</span> <span style="color: #35CDAF;">Startup</span>
    <span style="color: #C586C0;">{</span>
        <span style="color: #339CDB;">public</span> Startup<span style="color: #DB8E73;">(</span><span style="color: #35CDAF;">ILogger</span><span style="color: #579C4C;">&lt;</span><span style="color: #35CDAF;">Startup</span><span style="color: #579C4C;">&gt;</span> <span style="color: #85DDFF;">logger</span>, <span style="color: #35CDAF;">IConfiguration</span> <span style="color: #85DDFF;">configuration</span><span style="color: #DB8E73;">)</span>
        <span style="color: #DB8E73;">{</span>
            <span style="color: #339CDB;">this</span>.Logger = logger;
            <span style="color: #339CDB;">this</span>.Configuration = configuration;
        <span style="color: #DB8E73;">}</span>

        <span style="color: #339CDB;">public</span> <span style="color: #35CDAF;">ILogger</span><span style="color: #DB8E73;">&lt;</span><span style="color: #35CDAF;">Startup</span><span style="color: #DB8E73;">&gt;</span> <span style="color: #85DDFF;">Logger</span> <span style="color: #DB8E73;">{</span> <span style="color: #339CDB;">get</span>; <span style="color: #DB8E73;">}</span>

        <span style="color: #339CDB;">public</span> <span style="color: #35CDAF;">IConfiguration</span> <span style="color: #85DDFF;">Configuration</span> <span style="color: #DB8E73;">{</span> <span style="color: #339CDB;">get</span>; <span style="color: #DB8E73;">}</span>

        <span style="color: #579C4C;">// </span><span style="color: #579C4C;">This method gets called by the runtime. Use this method to add services to the container.</span>
        <span style="color: #339CDB;">public</span> <span style="color: #35CDAF;">void</span> <span style="color: #D9DAA2;">ConfigureServices</span><span style="color: #DB8E73;">(</span><span style="color: #35CDAF;">IServiceCollection</span> <span style="color: #85DDFF;">services</span><span style="color: #DB8E73;">)</span>
        <span style="color: #DB8E73;">{</span>
            <span style="color: #579C4C;">// </span><span style="color: #579C4C;">.. other stuff</span>

            <span style="color: #339CDB;">var</span> <span style="color: #85DDFF;">dqbSettings</span> = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryBuilderSettings</span>
            <span style="color: #579C4C;">{</span>
                <span style="color: #579C4C;">// </span><span style="color: #579C4C;">.. your settings(explained below)</span>
            <span style="color: #579C4C;">}</span>;

            services.<span style="color: #D9DAA2;">AddSingleton</span><span style="color: #579C4C;">(</span><span style="color: #35CDAF;">dqbSettings</span><span style="color: #579C4C;">)</span>;

            <span style="color: #579C4C;">// </span><span style="color: #579C4C;">.. other stuff</span>
        <span style="color: #DB8E73;">}</span>
    <span style="color: #C586C0;">}</span>
</pre>
</div>
</div>
</div>
