dqb.org
** Query Delivery Methods
DQB can retrieve your encoded/non-encoded queries via options like below:

- *Request QueryString*

Below, there is an example of configuring DQB to retrieve queries from query string

#+BEGIN_SRC csharp
string parameterToResolveFrom = "myparamtoresolve";
Func<string, string> decodeFunction = (encodedQuery) => magicDecode(encodedQuery);

new DynamicQueryBuilderSettings
{
    // Other configurations
    QueryOptionsResolver = new QueryStringResolver(parameterToResolveFrom, decodeFunction)
}
#+END_SRC

*Tip*: you can leave ~parameterToResolveFrom~ null to resolve your queries
directly from the raw querystring.

- *Request HTTP Header*
 
 Below, there is an example of configuring DQB to retrieve queries from HTTP Headers

#+BEGIN_SRC csharp
string httpHeaderName = "myhttpheadername";
Func<string, string> decodeFunction = (encodedQuery) => magicDecode(encodedQuery);

new DynamicQueryBuilderSettings
{
    // Other configurations
    QueryOptionsResolver = new HttpHeaderResolver(httpHeaderName, decodeFunction)
}
#+END_SRC

*Tip*: you can always leave ~decodeFunction~ null if your queries are not encoded.
