dqb.html

<div id="outline-container-org7b1f58e" class="outline-3">
<h3 id="org7b1f58e"><span class="section-number-3">9.2</span> Query Delivery Methods</h3>
<div class="outline-text-3" id="text-9-2">
<p>
DQB can retrieve your encoded/non-encoded queries via options like below:
</p>

<ul class="org-ul">
<li><b>Request QueryString</b></li>
</ul>

<p>
Below, there is an example of configuring DQB to retrieve queries from query string
</p>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #35CDAF;">string</span> <span style="color: #85DDFF;">parameterToResolveFrom</span> = <span style="color: #DB8E73;">"myparamtoresolve"</span>;
<span style="color: #35CDAF;">Func</span><span style="color: #C586C0;">&lt;</span><span style="color: #35CDAF;">string</span>, <span style="color: #35CDAF;">string</span><span style="color: #C586C0;">&gt;</span> <span style="color: #85DDFF;">decodeFunction</span> = <span style="color: #C586C0;">(</span>encodedQuery<span style="color: #C586C0;">)</span> =&gt; magicDecode<span style="color: #C586C0;">(</span>encodedQuery<span style="color: #C586C0;">)</span>;

<span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryBuilderSettings</span>
<span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Other configurations</span>
    QueryOptionsResolver = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">QueryStringResolver</span><span style="color: #DB8E73;">(</span>parameterToResolveFrom, decodeFunction<span style="color: #DB8E73;">)</span>
<span style="color: #C586C0;">}</span>
</pre>
</div>

<p>
<b>Tip</b>: you can leave <code>parameterToResolveFrom</code> null to resolve your queries
directly from the raw querystring.
</p>

<ul class="org-ul">
<li><p>
<b>Request HTTP Header</b>
</p>

<p>
Below, there is an example of configuring DQB to retrieve queries from HTTP Headers
</p></li>
</ul>

<div class="org-src-container">
<pre class="src src-csharp"><span style="color: #35CDAF;">string</span> <span style="color: #85DDFF;">httpHeaderName</span> = <span style="color: #DB8E73;">"myhttpheadername"</span>;
<span style="color: #35CDAF;">Func</span><span style="color: #C586C0;">&lt;</span><span style="color: #35CDAF;">string</span>, <span style="color: #35CDAF;">string</span><span style="color: #C586C0;">&gt;</span> <span style="color: #85DDFF;">decodeFunction</span> = <span style="color: #C586C0;">(</span>encodedQuery<span style="color: #C586C0;">)</span> =&gt; magicDecode<span style="color: #C586C0;">(</span>encodedQuery<span style="color: #C586C0;">)</span>;

<span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">DynamicQueryBuilderSettings</span>
<span style="color: #C586C0;">{</span>
    <span style="color: #579C4C;">// </span><span style="color: #579C4C;">Other configurations</span>
    QueryOptionsResolver = <span style="color: #339CDB;">new</span> <span style="color: #35CDAF;">HttpHeaderResolver</span><span style="color: #DB8E73;">(</span>httpHeaderName, decodeFunction<span style="color: #DB8E73;">)</span>
<span style="color: #C586C0;">}</span>
</pre>
</div>

<p>
<b>Tip</b>: you can always leave <code>decodeFunction</code> null if your queries are not encoded.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cem YILMAZ &lt;cmylmzbm@outlook.com&gt;</p>
<p class="date">Created: 2020-03-14 Cts 15:58</p>
</div>
</body>
</html>
